Revit 2026 API

# GradientTextureVRepeat Property

---

The property labeled "V Repeat" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TextureVRepeat { get; }
```
```vb
Public Shared ReadOnly Property TextureVRepeat As String
	Get
```
```cpp
public:
static property String^ TextureVRepeat {
	String^ get ();
}
```
```fsharp
static member TextureVRepeat : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

Gradient Class

Autodesk.Revit.DB.Visual Namespace